
// A module. The same as Drupal.behaviors.welcomeBanner,
// but will be imported in entry.js
var welcomeBanner = {
  attach: function (context, settings) {
    const greeting = `
  Welcome to

  ÛÛÛÛÛÛÛÛÛÛÛ  ÛÛÛÛÛ       ÛÛÛÛÛ  ÛÛÛÛÛÛÛÛÛ   ÛÛÛÛÛÛÛÛÛ       ÛÛÛÛÛÛÛÛÛ          
°°ÛÛÛ°°°°°ÛÛÛ°°ÛÛÛ       °°ÛÛÛ  ÛÛÛ°°°°°ÛÛÛ ÛÛÛ°°°°°ÛÛÛ     ÛÛÛ°°°°°ÛÛÛ         
 °ÛÛÛ    °ÛÛÛ °ÛÛÛ        °ÛÛÛ °ÛÛÛ    °°° °ÛÛÛ    °°°     ÛÛÛ     °°°   ÛÛÛÛÛÛ 
 °ÛÛÛÛÛÛÛÛÛÛ  °ÛÛÛ        °ÛÛÛ °°ÛÛÛÛÛÛÛÛÛ °°ÛÛÛÛÛÛÛÛÛ    °ÛÛÛ          ÛÛÛ°°ÛÛÛ
 °ÛÛÛ°°°°°ÛÛÛ °ÛÛÛ        °ÛÛÛ  °°°°°°°°ÛÛÛ °°°°°°°°ÛÛÛ   °ÛÛÛ    ÛÛÛÛÛ°ÛÛÛ °ÛÛÛ
 °ÛÛÛ    °ÛÛÛ °ÛÛÛ      Û °ÛÛÛ  ÛÛÛ    °ÛÛÛ ÛÛÛ    °ÛÛÛ   °°ÛÛÛ  °°ÛÛÛ °ÛÛÛ °ÛÛÛ
 ÛÛÛÛÛÛÛÛÛÛÛ  ÛÛÛÛÛÛÛÛÛÛÛ ÛÛÛÛÛ°°ÛÛÛÛÛÛÛÛÛ °°ÛÛÛÛÛÛÛÛÛ     °°ÛÛÛÛÛÛÛÛÛ °°ÛÛÛÛÛÛ 
°°°°°°°°°°°  °°°°°°°°°°° °°°°°  °°°°°°°°°   °°°°°°°°°       °°°°°°°°°   °°°°°°  
    `;

    console.log(greeting);
  }
}

// Export the module
module.exports = welcomeBanner;